const rawOwnersData = [
    {
        "name": "安装",
        "code": "110000",
        "sub": [
            {
                "name": "机械",
                "code": "110100",
                "sub": [
                    {
                        "name": "刘金涛",
                        "code": "110101"
                    }
                ]
            },
            {
                "name": "电气",
                "code": "110200",
                "sub": [
                    {
                        "name": "张吉祥",
                        "code": "110201"
                    }
                ]
            },
            {
                "name": "堆垛机",
                "code": "110300",
                "sub": [
                    {
                        "name": "宋计瑞",
                        "code": "110301"
                    }
                ]
            },
            {
                "name": "外协施工",
                "code": "110400",
                "sub": [
                    {
                        "name": "唐涛",
                        "code": "110401"
                    }
                ]
            }
        ]
    },
    {
        "name": "调试",
        "code": "120000",
        "sub": [
            {
                "name": "上位机",
                "code": "120100",
                "sub": [
                    {
                        "name": "谢遵磊",
                        "code": "120101"
                    }
                ]
            },
            {
                "name": "PLC",
                "code": "120200",
                "sub": [
                    {
                        "name": "袁居瀛",
                        "code": "120201"
                    }
                ]
            },
            {
                "name": "穿梭机",
                "code": "120300",
                "sub": [
                    {
                        "name": "刘建杨",
                        "code": "120301"
                    }
                ]
            },
            {
                "name": "堆垛机",
                "code": "120400",
                "sub": [
                    {
                        "name": "刘式杨",
                        "code": "120401"
                    }
                ]
            },
            {
                "name": "电气支持",
                "code": "120500",
                "sub": [
                    {
                        "name": "蒋海峰",
                        "code": "120501"
                    }
                ]
            },
            {
                "name": "机械支持",
                "code": "120600",
                "sub": [
                    {
                        "name": "邵奇",
                        "code": "120601"
                    }
                ]
            },
            {
                "name": "UAT",
                "code": "120700",
                "sub": [
                    {
                        "name": "李扬",
                        "code": "120701"
                    }
                ]
            }
        ]
    },
    {
        "name": "磨合",
        "code": "130000",
        "sub": [
            {
                "name": "多穿系统磨合",
                "code": "130100",
                "sub": [
                    {
                        "name": "邵奇",
                        "code": "130101"
                    }
                ]
            },
            {
                "name": "堆垛机磨合",
                "code": "130200",
                "sub": [
                    {
                        "name": "邵奇",
                        "code": "130201"
                    }
                ]
            },
            {
                "name": "折叠机及输送磨合",
                "code": "130300",
                "sub": [
                    {
                        "name": "邵奇",
                        "code": "130301"
                    }
                ]
            }
        ]
    },
    {
        "name": "商务跟踪",
        "code": "140000",
        "sub": [
            {
                "name": "各部门问题解决",
                "code": "140100",
                "sub": [
                    {
                        "name": "解鸿玥",
                        "code": "140101"
                    }
                ]
            }
        ]
    },
    {
        "name": "质检",
        "code": "150000",
        "sub": [
            {
                "name": "质检负责",
                "code": "150100",
                "sub": [
                    {
                        "name": "王绍蒙",
                        "code": "150101"
                    }
                ]
            }
        ]
    }
]

module.exports = {
    rawOwnersData
}